In [52]:
print("Jai Maa Kali")

Jai Maa Kali

In [53]:
import pandas as pd

In [141]:
x=pd.read_csv('hey.csv')

In [142]:
x.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [56]:
d=pd.get_dummies(x.town,dtype=int)

In [57]:
d

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [58]:
df=pd.concat([x,d],axis=1)

In [59]:
df

               town  area   price  monroe township  robinsville  west windsor
0   monroe township  2600  550000                1            0             0
1   monroe township  3000  565000                1            0             0
2   monroe township  3200  610000                1            0             0
3   monroe township  3600  680000                1            0             0
4   monroe township  4000  725000                1            0             0
5      west windsor  2600  585000                0            0             1
6      west windsor  2800  615000                0            0             1
7      west windsor  3300  650000                0            0             1
8      west windsor  3600  710000                0            0             1
9       robinsville  2600  575000                0            1             0
10      robinsville  2900  600000                0            1             0
11      robinsville  3100  620000                0            1             0
12      robinsville  3600  695000                0            1             0

In [60]:
df=df.drop('town',axis=1)

In [61]:
df.head()

   area   price  monroe township  robinsville  west windsor
0  2600  550000                1            0             0
1  3000  565000                1            0             0
2  3200  610000                1            0             0
3  3600  680000                1            0             0
4  4000  725000                1            0             0

In [62]:
df=df.drop('monroe township',axis=1)#To remove dummy trap

In [63]:
df.head()

   area   price  robinsville  west windsor
0  2600  550000            0             0
1  3000  565000            0             0
2  3200  610000            0             0
3  3600  680000            0             0
4  4000  725000            0             0

In [64]:
x=df.drop('price',axis=1)

In [65]:
y=df[['price']]

In [68]:
from sklearn.linear_model import LinearRegression

In [70]:
model=LinearRegression()

In [71]:
model.fit(x,y)

LinearRegression()

In [72]:
model.predict(x)

array([[539709.7398409 ],
       [590468.71640507],
       [615848.20468716],
       [666607.18125134],
       [717366.15781552],
       [579723.71533004],
       [605103.20361213],
       [668551.92431735],
       [706621.15674048],
       [565396.1513653 ],
       [603465.38378843],
       [628844.87207052],
       [692293.59277575]])

In [73]:
model.score(x,y)

0.9573929037221872

In [75]:
model.predict([[3000,0,0]])

C:\Users\barad\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[590468.71640507]])

In [76]:
#One Hot Encoding

In [77]:
from sklearn.preprocessing import LabelEncoder

In [78]:
m=LabelEncoder()

In [79]:
m

LabelEncoder()

In [89]:
x.town=m.fit_transform(x.town)

In [90]:
x.head()

   town  area   price
0     0  2600  550000
1     0  3000  565000
2     0  3200  610000
3     0  3600  680000
4     0  4000  725000

In [143]:
from sklearn.preprocessing import OneHotEncoder

In [152]:
x.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [158]:
categorical_columns=x.select_dtypes(include=['object']).columns.tolist()

In [159]:
categorical_columns

['town']

In [160]:
c=OneHotEncoder(sparse_output=False)

In [162]:
x.town=c.fit_transform(x[categorical_columns])

In [165]:
x.town=x.town.astype('int')

In [166]:
x.head()

   town  area   price
0     1  2600  550000
1     1  3000  565000
2     1  3200  610000
3     1  3600  680000
4     1  4000  725000

In [167]:
x.tail()

    town  area   price
8      0  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [168]:
x

    town  area   price
0      1  2600  550000
1      1  3000  565000
2      1  3200  610000
3      1  3600  680000
4      1  4000  725000
5      0  2600  585000
6      0  2800  615000
7      0  3300  650000
8      0  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [169]:
x[categorical_columns]

    town
0      1
1      1
2      1
3      1
4      1
5      0
6      0
7      0
8      0
9      0
10     0
11     0
12     0

In [170]:
print("Jai Maa Kali")

Jai Maa Kali

In [171]:
data = {'Employee id': [10, 20, 15, 25, 30],
        'Gender': ['M', 'F', 'F', 'M', 'F'],
        'Remarks': ['Good', 'Nice', 'Good', 'Great', 'Nice'],
        }

In [172]:
x=pd.DataFrame(data)

In [173]:
x.head()

   Employee id Gender Remarks
0           10      M    Good
1           20      F    Nice
2           15      F    Good
3           25      M   Great
4           30      F    Nice

In [174]:
from sklearn.preprocessing import OneHotEncoder

In [178]:
categorical_columns=x.select_dtypes(include=['object']).columns.tolist()

In [179]:
categorical_columns

['Gender', 'Remarks']

In [191]:
c=OneHotEncoder(sparse_output=False)

In [192]:
y=c.fit_transform(x[categorical_columns])

In [193]:
y

array([[0., 1., 1., 0., 0.],
       [1., 0., 0., 0., 1.],
       [1., 0., 1., 0., 0.],
       [0., 1., 0., 1., 0.],
       [1., 0., 0., 0., 1.]])

In [195]:
z=pd.DataFrame(y,columns=c.get_feature_names_out(categorical_columns))

In [198]:
df=pd.concat([x,z],axis=1)

In [199]:
df.head()

,Employee id,Gender,Remarks,Gender_F,Gender_M,Remarks_Good,Remarks_Great,Remarks_Nice
0,10,M,Good,0.0,1.0,1.0,0.0,0.0
1,20,F,Nice,1.0,0.0,0.0,0.0,1.0
2,15,F,Good,1.0,0.0,1.0,0.0,0.0
3,25,M,Great,0.0,1.0,0.0,1.0,0.0
4,30,F,Nice,1.0,0.0,0.0,0.0,1.0

In [200]:
print("Jai Maa Kali")

Jai Maa Kali